---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetConstruction
source: html/fa96b863-c35d-d0ea-42b1-032d619a3d5a.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetConstruction Method

Gets the analytic construction this surface is associated with.

## Syntax (C#)
```csharp
public EnergyAnalysisConstruction GetConstruction()
```

## Returns
The analytic construction.